_posts/2016-02-05-split-pdf-file-by-bookmarks.html
---
layout: post
title: Split PDF files by bookmarks
excerpt: Sejda, a Java library and CLI utility for manipulating PDF files.
---

<p>
<a href="http://www.sejda.org/download/">Sejda</a> is a Java library and command line utility for manipulating PDF
files. It's the best solution I've been able to find for a free, CLI utility
that can split PDF documents by bookmarks.
</p>

<p>
There are many websites and desktop applications, mostly non-free, for
manipulating PDF files. Not many, however, offer the ability to split PDF
files by bookmark. Adobe Acrobat <a href="https://answers.acrobatusers.com/how-split-multipage-pdf-file-q100034.aspx">does offer this capability</a>, but it's much too
heavy-weight for the simple tasks I'd like to perform.
</p>

<p>
PDF files are nice because they're portable and (relatively) tool-friendly
(e.g. you can search PDF documents with <a href="https://pdfgrep.org/">pdfgrep</a>), although not as
<a href="https://github.com/emacs-helm/helm/wiki/Info-Files">Emacs-friendly</a> as Info files. Emacs, however, cannot display large PDF files
efficiently, because the default <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Document-View.html#Document-View">DocView mode</a> has to render each page of the
PDF document as an image.
</p>

<p>
The Common Lisp Recipes book weighs in at 755 pages, which is much too for
DocView to handle. What to do? Well, we'll split the book by chapter.
</p>

<p>
First, give yourself execution permission on the file:
</p>

<div class="org-src-container">

<pre class="src src-sh">chmod +x bin/sejda-console
</pre>
</div>

<p>
Next, check out the <a href="http://www.sejda.org/shell-interface/tutorial/">tutorial</a> for available commands. We want
<code>splitbybookmarks</code>, which
</p>

<blockquote>
<p>
Splits a given pdf document before each page where exists a GoTo action in the
document outline (bookmarks) at the specified level (optionally matching a
provided regular expression).
</p>
</blockquote>

<p>
The command we want is
</p>

<div class="org-src-container">

<pre class="src src-sh">sejda-console splitbybookmarks -f &lt;file-name&gt;.pdf -o &lt;output-dir&gt; -l 2 -e "(.*)([1-9I])(.+)" -p "[BOOKMARK_NAME_STRICT]"
</pre>
</div>

<p>
Explanations of the command options:
</p>

<ul class="org-ul">
<li><code>-l &lt;level&gt;</code> means split by bookmarks at <code>&lt;level&gt;</code>, in this case <code>2</code>, which
is the level for Common Lisp Recipes' chapters.
</li>
<li><code>-e &lt;regexp&gt;</code> means split only on bookmarks matching the
<code>&lt;regexp&gt;</code>. <code>([1-9I])</code> means "bookmarks with names including a digit or the
letter I", the letter "I" being the first letter of the "Index" chapter. The
way that we have to specify regexp is a bit strange (having to use <code>(.*)</code>
and <code>(.+)</code>).
</li>
<li><code>-p &lt;output-prefix-option&gt;</code> means to use an <a href="http://www.sejda.org/development/the-outputprefix-option/">output prefix</a> to name
files. <code>[BOOKMARK_NAME_STRICT]</code> uses the bookmark (i.e. chapter) name, but
strips out non-alphanumeric characters.
</li>
</ul>
